######################################################################
# 前準備
######################################################################

######################################################################
# OpenAI APIキーの取得確認
# OSの環境変数に設定したAPIキー取得し、
# 変数OPEN_API_KEYに格納する。
# 環境変数を取得できなかった場合はエラー
######################################################################

import os
OPENAI_API_KEY = os.getenv("OPENAI_API_KEY")

if not OPENAI_API_KEY:
    raise ValueError("環境変数 'OPENAI_API_KEY' が設定されていません。")

print(OPENAI_API_KEY)